const articles = [
  {
    title: "Комплексное бухгалтерское сопровождение",
    article:
      "Комплексное бухгалтерское обслуживание, предложенное нашей консалтинговой компанией, — это возможность получить качественную бухгалтерскую и налоговую поддержку вашего бизнеса. <br>В чем заключается суть данной услуги? <br>В жизни каждой компании в определённый момент появляется вопрос ведения бухгалтерского учёта. Он может осуществляться посредством управленческого персонала: непосредственно самим бухгалтером или бухгалтерами, или же посредством привлечения сторонней фирмы. О важности и целях ведения бухгалтерского учёта, думаем, упоминать смысла нет, а вот пояснить почему же именно комплексное бухгалтерского обслуживание сторонней организацией будет выгодно-стоит. <br>Во-первых, это даёт возможность перенаправить силы управленческого персонала на решение более актуальных проблем. <br>Во-вторых, освобождает организацию от выделения значительных ресурсов на налоговое планирование и решение бухгалтерских вопросов. <br>В-третьих, человеческий фактор оказывает меньшее влияние на конечный результат, так как договор заключается с группой лиц, а не частным бухгалтером. <br> В-четвёртых, вам даётся полная гарантия в своевременном и качественном выполнении задания опытным специалистом. <br>'Подходит ли мне заключение договора на бухгалтерское ведение?'<br> В комплексном бухгалтерском обслуживании нуждаются юридические лица и индивидуальные предприниматели, представители малого и среднего, и большего бизнесов. В каких-то случаях и в каких-то организациях, хороший специалист оказывается слишком дорогой роскошью, а в каких-то даже его наличие является недостаточной силой, чтобы суметь всецело уследить за столь трудоемким процессом как оформление финансово-хозяйственных средств компании, именно поэтому бухгалтерский аутсорсинг является подходящим выходом из затруднительной ситуации.<br>Все ваши вопросы, связанные с<br> · постановкой на учёт с нуля,<br> · работой с первичными документами,<br> · обработкой кадровых документов,<br>· расчетом заработной платы,<br> · формированием платежных поручений,<br> · созданием и обработкой кассовых документов,<br> · расчетом налогов и сдачей необходимой отчетности в контролирующие органы будут решены.<br> Ваша задача — обеспечить нас первичными документами, а наша — выполнить все налоговые и бухгалтерские обязанности в порядке и сроках, предусмотренными законодательством Российской Федерации и с использованием передовых программ. Всегда совершенствуясь, повышая свой уровень, мы полностью погрузимся в сферу ваших интересов, создав общие цели и сделав ваше обращение к нам одной из самых выгодных сделок в развитии фирмы.",
  },
  {
    title: "Услуги бухгалтера на первичные документы",
    article:
      "Чек является одним из примеров первичного документа, важность которого недооценена.<br> В жизни мы не придаём значения такому пустяку, но в случае с бизнесом таких оплошностей нельзя совершать.<br> Любой квиток, данный при продаже или же получении товаров, при заключении любого вида сделки лежит в основе оформления и ведения хозяйственных операций.<br> Несмотря на простоту оформления первичных документов, они обладают в некоторых моментах юридической силой, а также являются базой ведения бухгалтерского учёта. Зачем же для таких 'пустяков' нужен квалифицированный специалист?<br> · В первую очередь, для правильной обработки и подготовки первичной документации.<br> · Для наблюдения за соблюдением таких требований, как своевременность составления, сроки хранения, наличие реквизитов и др..<br> · Для контроля, при котором проверяются документы по существу.<br> · Для группировки документов и сведения данных.<br> · Для составления проводок на основе первичных документов.<br> · Для планирования документооборота. <br>Конкретно, нашей фирмой будет предложены следующие услуги:<br> · Работа с первичными документами. Создание, проверка, обработка в 1С Бухгалтерия.<br> · Обработка кадровых документов. Приказы, заявления, трудовые книжки, трудовые договора.<br> · Расчет заработной платы. Расчет налогов и взносов с заработной платы.<br> · Формирование платежных поручений. Обработка банковских выписок<br> · Создание и обработка кассовых документов.<br> Первичная документация раскрывает содержание и особенности операций, сохраняет данные для сверки, учёта, анализа и оперативного управления. Этот процесс крайне важен для беспроблемного, соответствующего 'букве закона', эффективного ведения бухгалтерского и налогового учёта, поэтому-то доверие профессионалу так необходимо. И наша консалтинговая компания готова вам предоставить такого человека, который вам не даст повода усомниться в нем и поспособствует успеху вашей фирмы.",
  },
  {
    title: "Услуги главного бухгалтера",
    article:
      "Услуги главного бухгалтера-ваша возможность получить профессиональный надзор за исполнением бухгалтерских и налоговых обязанностей. Отличительной особенностью данной услуги является непосредственный контроль за ведением финансово-хозяйственной жизни вашей фирмы. Будучи отдельным целостным функциональным подразделением, многие риски и издержки, связанные с личным обеспечением главного бухгалтера, мы исключаем или же берём на себя.<br> Итак, вот одни из самых очевидных плюсов:<br> · Качественный контроль и экономический анализ;<br> · Своевременное выполнение задач<br> · Соблюдение законодательных норм;<br> · Гибкость в ценовом вопросе;<br> · Гарантии. Непосредственно, вы получите следующие услуги:<br>· Постановка учета с нуля;<br> · Расчет налогов и сдача необходимой отчетности в контролирующие органы;<br> · Консультирование по вопросам налогообложения и ведения учета.<br> И для этого всего-навсего требуется передача обработанных первичных документов нам.<br> Вас смущает сам факт передачи?<br> Не волнуйтесь, в первую очередь, вы имеете дело с высоко-квалифицированными специалистами с опытом работы в данной сфере и репутацией. Более того, мы заключим договор на предоставление услуги главного бухгалтера, в котором будут обговорены все интересующие вас вопросы. Да и не секрет, что от того, как будет подготовлена документация и насколько качественно, зависит финансовая сторона успеха жизни бизнеса , поэтому-то риски, связанные с ведением бухгалтерского учёта, следует сводить к минимуму, а обращение к аутсорсингу бухгалтерии как раз и является одним из самых эффективных способов это сделать.",
  },
  {
    title: "Сдача нулевой отчетности",
    article:
      "Хороший вопрос: 'Что было первее яйцо или курица ?'. На него невозможно ответить, однако на вопрос 'Я зарегистрировал предприятие, но не веду деятельность, нужно ли мне вести отчётность?' ответ есть: 'Да, нужно вести нулевую отчётность'.<br> Итак, любое предприятие в самом начале его жизни должно 'родиться', в правовой сфере этому процессу соответсвует такой термин, как регистрация. Далее следует взросление, во время которого предприятие набирается сил и готовится к 'выходу в свет', нас интересует именно этот период, так как он сопровождается неприкосновенностью активов. Логично, если человек не тратит денег, то и ему не надо ни перед кем отчитываться, но такой обыденный закон не применим в экономической сфере. В данном случае, даже если вы и 'тише воды, ниже травы', то вам это нужно доказать, в первую очередь посредством нулевого баланса и сдачи нулевой отчетности.<br> 'И что же мне делать?'<br> Для начала нужно понять, что многое зависит от формы предпринимательской деятельности и режима налогообложения, так если Вы<br> · Предприятие с обычной системой налогообложения, то вам обязательно нужно вести нулевой баланс и сдавать нулевую декларацию<br> · Организация с иной системой налогообложения и ИП ,то обязательна только сдача нулевой декларации<br> И это один из самых поверхностных нюансов, с которыми вы столкнётся в период взросления вашей фирмы, именно поэтому вам придётся всерьёз задуматься над этим вопросом и одним из способов его решить-обратиться в стороннюю компанию за услугой сдачи нулевой декларации.<br> Наша фирма предлагает вам полную подготовку и сдачу комплекта документов, а именно декларацию по:<br> · НДС · Налогу на прибыль<br> · Налогу на имущество<br> А также:<br> · Единый расчёт по страховым взносам<br> · Бухгалтерскую отчётность<br> Непосредственная сдача может проходит через электронные каналы связи или же почтой РФ. Вся подготовка происходит опытными специалистами, знающими сроки подачи документов, форму их заполнения, набор документов , говоря общо, абсолютно все те значительные моменты ведения бухгалтерского и налогового учёта и сдачи отчётности, который убедят вас в нашей компетентности и незаменимости.",
  },
  {
    title: "Восстановление учета",
    article:
      "Что такое прогресс?<br> Это процесс улучшения в модусах времени, а также это цель любой организации.<br> Почему прогресс так важен?<br> Он обеспечивает и качественный и количественный рост, сопровождающийся в первую очередь притоком денежных средств, которые нужно не забыть учесть и отразить.<br> А что делать, если все же «забыл» или не успел, или не сумел?<br> В данной ситуации целесообразно обратиться за восстановлением бухгалтерского и налогового учёта. Данная услуга подразумевает под собой воссоздание регистров и отчётности за прошедшее время.<br> В каких случаях незамедлительно нужно прибегнуть к восстановлению?<br> 1. Если бухгалтерский и налоговый учёт вёлся неквалифицированным специалистом;<br> 2. Если вдруг ваш бухгалтер исчез и уже какой месяц не выходит на контакт ( и такое бывает);<br> 3. Если были допущены значительные неточности ведения учёта;<br> 4. Если в скором времени собирается нагрянуть налоговая проверка, а вы неуверенны в безупречном состоянии ваших документов;<br> 5. Если налоговая уже 'ощипала' вас и вам начислены пени и штрафы, но вы надеетесь сократить сумму к уплате;<br> 6. Если понимаете, что ваш бухгалтер действительно сильно нагружен и нужно его 'подстраховать';<br> 7. Если первичные документы не соответствуют финансовой картине.<br> Что мы можем вам предложить?<br> · Экспресс аудит состояния бухгалтерского и налогового учета;<br> · Сверку расчетов с контрагентами;<br> · Запрос недостающих первичных документов у контрагентов;<br> · Восстановление первичных документов;<br> · Полное либо частичное восстановление учета;<br> · Пересдача уточненных отчетов с минимальными штрафами и пенями.<br> Следует пояснить момент, связанный с видами восстановления:<br> 1) Полное- комплексный анализ хозяйственных процессов, сопровождающийся исправлением всех ошибок и обработкой документов за прошедшие периоды. Сдача отчётности.<br> 2) Частичное- точечное вмешательство.<br> Итак, мы вам поможем проанализировать ваши документальные базы, проверим все начисления, выявим проблемы, разработаем рекомендации для повышения эффективности ведения бухгалтерского учёта. Это все означает одно, если у вас есть какие-то нерешенные вопросы мы всегда будем рады вам помочь, за вами только как можно больше первичной документации и при возможности база 1С , которую вёл или ведёт ваш бухгалтер.",
  },
  {
    title: "Разблокировка расчетного счета",
    article:
      "Стабильность фирмы напрямую зависит от того, как исполняются обязанности. Так, к примеру, декларации, отчёты, налоги- все это должно быть вовремя сдано в налоговую службу, иначе директора ждёт уведомление о том, что счета его компании заблокированы, а также соответствующие пени и штрафы начислены. Что же делать в сложившейся ситуации?<br> В первую очередь следует понимать, что каждая 'простойка' отразится на прибыли, а это значит, что нужно побыстрее понять, в чем именно заключается ошибка и немедленно начинать действовать. Скорее всего, вам придётся получать выписку из банка или даже выписки, если у вас несколько расчётных счетов, также подавать декларацию и уплачивать штрафы. Несложно догадаться, что этот процесс довольно-таки много занимает времени.<br> Более того, может так выйти, что сложится спорная ситуация с налоговыми органами.<br> А что же делать, если обнаружатся ещё и недочеты в бухгалтерской отчётности? Или же важный член персонала болен? Да ещё и сроки поджимают?<br> В данном случае надежнее обратиться в стороннюю организацию, которая сможет решить данную проблему в короткий срок с наименьшими потерями. Наша консалтинговая фирма готова помочь вам с этим, конкретно с:<br> · Выяснением причин блокировки расчетного счета;<br> · Урегулированием спорных ситуаций с налоговым органом;<br> · Пересдачей отчетности;<br> · Зачетом налогов, сборов.",
  },
];
const taxesArticle = [
  {
    title: "Консультации для физических лиц",
    article:
      "Каждый человек рано или поздно получит свой первый доход, которым может быть продажа машины или дома, заработная плата, дивиденды или же многое другое. Это, естественно, радостное событие, но нужно понимать, что с возникновением дохода появляются и определённые обязанности перед налоговой службой. Также, такие обязательства обнаруживаются и при приобретении имущества и транспорта.<br> Итак, что конкретно может от вас потребоваться?<br> Практически при любом раскладе вы должны заполнять 3-ндфл и в соответсвии с этим документом уплачивать налог или возвращать его часть из бюджета.<br> Возвращать?<br> Именно, во-первых, будучи официально устроенным физическом лицом, бухгалтерский отдел компании-нанимателя удерживает с вашей заработной платы тринадцати процентный налог, именуемый как налог на доходы физических лиц (НДФЛ). Что хорошо в данной ситуации, так то, что мы не «забиваем» голову вопросами об его исчислении, однако нередка ситуации, когда бухгалтерия не уведомила вас, что вы можете использовать некоторые из вычетов.<br> Всего их существует 5 видов:<br> · Имущественный<br>· Инвестиционный<br> · Стандартный<br> · Социальный<br> · Профессиональный<br> · При переносе на будущие периоды убытков от операций с ценными бумагами и операций с финансовыми инструментами срочных сделок<br> Так, стандартные и социальные вычеты являются теми, которые вам предоставляются посредством работодателя, а вашей задачей является только предъявить документы, подтверждающее право на них. Это хорошо тем, что налогооблагаемая база, с которой исчисляется ваш налог может быть значительно занижена, а следовательно и сумма к уплате в налоговый орган будет меньшей, нулевой, или же с уже удержанного налога вам будет возвращена часть денег из бюджета.<br> Это все, безусловно, прекрасно, но всегда есть свои подводные камни. В этой теме-это крайне сложный материал налогового кодекса Российской Федерации, в котором действительно трудно самому качественно разобраться, а ведь оно того стоит!<br> Есть и ещё один важный момент, который касается нашей слабости-автомобиля. Кому же не хотелось иметь красивую мощную машину? Ответ тут очевиден, но нужно помнить что транспортный налог является региональным, а это значит, что, при регистрации ТС в разных регионах, ставка будет не единой, а следовательно и сумма к уплате будет различаться.<br> Наша консалтинговая компания предлагает вам услугу налогового консультирования физических лиц, благодаря которой все вопросы, связанные с:<br> · Подготовкой 3-НДФЛ<br> · Консультированием по вычетам и льготам по НДФЛ<br> · Консультации по дарению<br> · Налогом на имущество<br> · Транспортным налогом<br> Будут обсуждены, доступно разобраны и ликвидированы.",
  },
  {
    title: "Консультации для новичков в бизнесе",
    article:
      "Каждый человек хоть раз задумывался над тем, что одним из самых прибыльных занятий является построение своего бизнеса. Это базируется на нескольких факторах:<br> · Полный контроль в том, что вы решили делать<br> · 'Сам себе босс'<br> · Удовлетворение предпринимательских и организаторских амбиций<br> · Успех предприятия зависит в первую очередь от ваших же усилий и компетенции<br> Однако, начиная свой бизнес, новичку необходимо абстрагироваться от головокружительных плюсов и обратить внимание на 'подводные камни'. Одним из самых крупных является российское законодательство, особенно в сфере налогов. Мало суметь зарегистрировать бизнес и начать какие-либо действия, нужно ещё и обеспечивать обратную связь с налоговыми органами, правильную связь.<br> Что это означает? Для начала, нужно полностью разобраться в том, какие же налоги должен уплачивать в бюджет участник рынка. Простейшие классификации:<br> · Федеральные<br> · Региональные<br> · Местные<br> И<br> · Прямые<br> · Косвенный<br> Далее, полночью оперируя этими понятиями нужно классифицировать все виды налогов в соответствии с налоговым кодексом Российской Федерации и определить какие же из них будут изыматься именно с вас.<br> Если эти два пункта вышли-хорошо, ведь потом следует понять порядок и сроки их исчисления, найти, если есть ли льготы и вычеты и соотнести с нашей возможностью или невозможностью их получить. Разбираясь с этими вопросами, вы 100% наткнётесь на различные системы налогообложения. Они , в свою очередь, также представляют ряд различных преимуществ. И все это лишь на поверхности.<br> Все это далеко не просто. Именно поэтому наша консалтинговая компания предлагает вам услугу 'налоговая консультация для новичков в бизнесе'. Данная программа включает в себя:<br> · Обзорную консультацию по действующим налогам<br> · Выбор оптимального налогообложения<br> · Анализ налоговой нагрузки<br> Все это поможет вам правильно и качественно построить свой бизнес, решить коварные вопросы бухгалтерского и налогового учёта, правильно распределить роли ответственного персонала.",
  },
  {
    title: "Консультации для юридических лиц",
    article:
      "Мечта почти каждого амбициозного человека-иметь свой бизнес. В том случае, если вы все же смогли достигнуть своей цели, мы можем говорить уже непосредственно об этапе регистрации и о выборе между становлением ИП или юридическим лицо<br> Итак, если выбор был сделан в пользу второго, то вы приняли на себя ряд обязательств перед государством , касающихся этой категории налогоплательщиков. На данный момент очень важно понимать, что конкретно вы должны уплачивать в бюджет, на каких условиях облагаемую сумму можно занизить и какие последствия вас ждут за то или иное налоговое нарушение, ведь от этого зависит размер чистой прибыли. На сегодняшний день юридическое лицо обязано уплачивать ряд налогов, а именно:<br> · Налог на добавленную стоимость<br> · Налог на имущество организации<br> · Земельный налог<br> · Транспортный налог <br>Так, к примеру, на практике, НДС является самым сложным налогом в исчислении с множеством подводных камней: ставки, виды и т.п. Однако наше государство, идя навстречу своим налогоплательщикам предлагает нам различные права, одним из которых является освобождение, предоставляющее возможность организациям, использующим отличную от общей систему налогообложения или же имеющим за три предшествующих последовательно месяца доход не более двух миллионов рублей с не подакцизных товаров, не уплачивать налог в течение 12 календарных месяцев. Также существует ряд налоговых вычетов по НДС, которые смогут понизить доход от реализации и пересдаче товаров, работ и услуг. Наша консалтинговая компания предлагает вам услугу по консультации юридических лиц, благодаря которой вы узнаете, какую систему налогообложения лучше использовать в целях экономии, при каких условиях вы можете получить освобождения от обязанности уплачивать тот или иной налог, и какие вычеты существуют. Также, консультируя ваших специалистов, мы пройдём с вами налоговую проверку, а по итогам составим дальнейший план действий. И это «верхушка айсберга», потому что правильное консультирование в этой теме облегчит также и прохождение налоговых проверок. А , конкретно, мы предлагаем вам:<br> · Разработку законных схем минимизации налогов<br> · Текущее консультирование генерального директора и/или главного бухгалтера<br> · Сопровождение налоговых проверок<br> · Оценку налоговых рисков и последствий сделок<br> Как говорится,в мире неизбежны только две вещи-это смерть и налоги, условно первое юридическим лицам не грозит, а вот второе становится неотъемлемой частью жизни организаций, и чем лучше руководители и управляющий персонал ладят с ними, тем удачнее будет затеянное предприятие.",
  },
];
const edu = [
  {
    title: "Обучение выпускников ВУЗов практическим навыкам",
    article:
      "- Обработка первичных документов<br> - Закрытие периодов<br> - Подготовка отчетности<br> - Порядок сдачи отчетности",
  },
  {
    title: "Обучение бухгалтера до главного бухгалтера",
    article:
      "- Закрытие периодов<br> - Подготовка отчетности<br> - Порядок сдачи отчетности",
  },
  {
    title: "Консультирование и методологическая поддержка",
    article:
      "- Ответим на сложные вопросы<br> - Поделимся практическим опытом<br> - Поможем вести учет",
  },
  {
    title: "Дистанционное обучение и консультирование через Skype",
    article:
      "- Обучение выпускников ВУЗов практическим навыкам<br> - Обучение бухгалтера до главного бухгалтера<br> - Консультирование и методологическая поддержка",
  },
];
const staff = [
  {
    title: "Подбор персонала на позицию Главный бухгалтер",
    article:
      " - Подбираем высококвалифицированных специалистов с подходящим психотипом для вашего коллектива<br> - Гарантия для замены сотрудника 6 месяцев<br> - Стоимость подбора составляет 7% от годовой зарплаты",
  },
  {
    title: "Подбор персонала на позицию Бухгалтер",
    article:
      "- Подбираем высококвалифицированных специалистов с подходящим психотипом для вашего коллектива<br> - Гарантия для замены сотрудника 6 месяцев<br> - Стоимость подбора составляет 10% от годовой зарплаты",
  },
  {
    title: "Подбор персонала на позицию финансовый менеджер",
    article:
      "- Подбираем высококвалифицированных специалистов с подходящим психотипом для вашего коллектива<br> - Гарантия для замены сотрудника 6 месяцев<br> - Стоимость подбора составляет 10% от годовой зарплаты",
  },
];
const ones = [
  {
    title: "Обучение 1С",
    article:
      "Рано или поздно любому предпринимателю придется столкнуться с программным продуктом компании “1C”. Если вы умелый пользователь – вам крупно повезло, если же нет, то вам тоже повезло, так как вы читаете именно эту статью.<br> На сегодняшний день продукты “1С” являются неким стандартом для ведения бухгалтерского, налогового и управленческого учета. Многие работодатели требуют от своих сотрудников определенных навыков для работы с этой программой.<br> Мы предлагаем подтянуть ваш навык работы с “1С” или же поднять уровень с нуля. Наши специалисты разработают программу обучения специально для вас. Вариант обучения вы выбираете сами: удаленно или у нас в офисе. К тому же, обучение не будет строиться исключительно на теории, мы будем с вами учиться на функционирующих предприятиях.<br> Существует несколько правил работы с “1С”, которые должен знать каждый бухгалтер:<br> 1. Необходимо регулярно создавать копии ваших баз данных;<br> Многие об этом знают, но не все соблюдают это важное правило. Поверьте, те, кто хотя бы раз восстанавливал утраченную базу данных – навсегда запомнят это правило.<br> 2. Своевременно обновлять информационные базы и следить за изменениями; В настоящее время обновления выпускаются довольно часто, поэтому необходимо постоянно держать вашу программу в актуальном состоянии, чтобы избежать форс-мажоров в отчетные периоды.<br> 3. Пользоваться сервисом “1С:Отчетность”;<br> Это можно скорее отнести к рекомендации, так как этот сервис очень удобен.<br> С помощью этого сервиса отпадает необходимость выгружать и загружать отчеты в другие программы. Оперативное получение информации из контролирующих органов будет определенно на руку во всех ситуациях. Всегда можно найти последнюю версию отчета, которая действительно была отправлена. Многое другое вы сможете познать лишь с профессиональным бухгалтером, который обучит вас всем тонкостям работы.<br> Именно с этим мы вам и поможем.",
  },
  {
    title: "Обновление продуктов 1С",
    article:
      "Наши специалисты произведут удаленное (выездное) обновление типовых либо измененных программных продуктов 1С",
  },
  {
    title: "Доработка и настройка программ 1С",
    article: "Любые изменение в 1С под нужды бизнеса",
  },
  {
    title: "Консультация по работе в программах 1С",
    article:
      "Наши специалисты ответят на все Ваши вопросы об 1С<br> А так же удаленно покажут решения Ваших вопросов через специализированную программу",
  },
];
const another = [
  {
    title: "Бюджетирование и бизнес планирование",
    article: "Бюджетирование и бизнес планирование",
  },
  {
    title: "Юридические услуги",
    article:
      "Регистрация и ликвидация юридических лиц и ИП<br> Налоговые споры<br> Представительство в суде",
  },
  {
    title: "Архивная обработка документов",
    article: "Архивная обработка документов",
  },
];

let inDiv = document.querySelector(".service-articles");

document.querySelectorAll(".service-button").forEach((item, index) => {
  item.addEventListener("click", () => {
    let articleDiv = `<div class="service-article">
  <div class="service-article-title">
      ${articles[index].title}
  </div>
  <div class="service-counting-line">

  </div>
  <div class="service-article-text">
  ${articles[index].article}
  </div>
  <a href="./index.html#contacts">Заказать услугу &#187;</a>
</div>`;
    inDiv.innerHTML = articleDiv;
  });
});
document.querySelectorAll(".taxes-button").forEach((item, index) => {
  item.addEventListener("click", () => {
    let articleDiv = `<div class="service-article">
  <div class="service-article-title">
      ${taxesArticle[index].title}
  </div>
  <div class="service-counting-line">

  </div>
  <div class="service-article-text">
  ${taxesArticle[index].article}
  </div>
  <a href="./index.html#contacts">Заказать услугу &#187;</a>
</div>`;
    inDiv.innerHTML = articleDiv;
  });
});

document.querySelectorAll(".edu-button").forEach((item, index) => {
  item.addEventListener("click", () => {
    let articleDiv = `<div class="service-article">
  <div class="service-article-title">
      ${edu[index].title}
  </div>
  <div class="service-counting-line">

  </div>
  <div class="service-article-text">
  ${edu[index].article}
  </div>
  <a href="./index.html#contacts">Заказать услугу &#187;</a>
</div>`;
    inDiv.innerHTML = articleDiv;
  });
});
document.querySelectorAll(".staff-button").forEach((item, index) => {
  item.addEventListener("click", () => {
    let articleDiv = `<div class="service-article">
  <div class="service-article-title">
      ${staff[index].title}
  </div>
  <div class="service-counting-line">

  </div>
  <div class="service-article-text">
  ${staff[index].article}
  </div>
  <a href="./index.html#contacts">Заказать услугу &#187;</a>
</div>`;
    inDiv.innerHTML = articleDiv;
  });
});

document.querySelectorAll(".ones-button").forEach((item, index) => {
  item.addEventListener("click", () => {
    let articleDiv = `<div class="service-article">
  <div class="service-article-title">
      ${ones[index].title}
  </div>
  <div class="service-counting-line">

  </div>
  <div class="service-article-text">
  ${ones[index].article}
  </div>
  <a href="./index.html#contacts">Заказать услугу &#187;</a>
</div>`;
    inDiv.innerHTML = articleDiv;
  });
});

document.querySelectorAll(".another-button").forEach((item, index) => {
  item.addEventListener("click", () => {
    let articleDiv = `<div class="service-article">
  <div class="service-article-title">
      ${another[index].title}
  </div>
  <div class="service-counting-line">

  </div>
  <div class="service-article-text">
  ${another[index].article}
  </div>
  <a href="./index.html#contacts">Заказать услугу &#187;</a>
</div>`;
    inDiv.innerHTML = articleDiv;
  });
});

document.querySelectorAll(".blog-item").forEach((item) => {
  let blockHeight = 69;
  if (item.offsetHeight < blockHeight) {
    blockHeight = item.offsetHeight;
  }
  item.style.height = blockHeight + "rem";
});

const news = [
  {
    title: "Может ли ИП обойтись без бухгалтера",
    src: "./images/without.png",
    span: "15 МАЯ 2023",
    article:
      " Индивидуальные предприниматели (ИП) считают, что на режимах УСН «доходы» и ПСН легко можно обойтись без бухгалтера, к тому же учет вести нет необходимости. <br><br> Когда бухгалтер действительно не нужен?<br><br>Чаще всего не нужны услуги бухгалтера ИП, которые: <br><br>Не собираются переходить на более сложные режимы учета (УСН «доходы минус расходы» и ОСНО)<br><br>Не планируют нанимать сотрудников. Даже один сотрудник в штате – это дополнительные отчеты. <br><br> Не собираются приобретать основные средства, машины, здания, станки, оборудование за собственные средства или в лизинг.",
  },
  {
    title: "Стратегия финансового роста",
    src: "./images/finrise.png",
    span: "4 МАЯ 2023",
    article:
      " Автор: Елена Имарова, руководитель и собственник бухгалтерской копании, наставник бухгалтеров.<br><br> В 21 веке ежедневно растут потребности человека в различных сферах жизни, растут «хотелки». Перед нами встает вопрос: как увеличить свои личные финансы. Для этого нам нужна стратегия. Стратегия это общий генеральный план по управлению личными денежными средствами для воплощения в жизнь нашу мечту. Мечты и цели у каждого могут быть совершенно разные: от покупки красивого платья до благоустройства городского парка. Стратегия – искусство планирования, основанного на правильных и далеко идущих прогнозах.<br><br> Для построения личной финансовой стратегии нам необходимо иметь в арсенале три компонента: установки, знания и навыки.<br><br><b>Установки</b> или базисный элемент формируют культуру поведения в области планирования личного (семейного) бюджета.<br><br><b>Знания</b> нужны для понимания происходящего на рынке, понимание принципов функционирования финансовых институтов и инструментов, владение основами юриспруденции и налогообложения.<br><br> Третий элемент – <b>навыки</b>. Очень важно обладать различными навыками. Например, умение разбираться и понимать условия договоров гражданско-правового характера, проводить анализ предложений компаний с целью выбрать наиболее подходящий вариант.<br><br> Наличие трех вышеуказанных критериев позволит человеку формировать эффективную финансовую стратегию. Она в свою очередь приведет к достижению поставленных целей.<br><br> А как нарастить свои личные финансы? По статистике, большая часть населения страдает от проблемы нехватки средств на урезании расходов. Если рассчитывать исключительно на экономию, то это провальный подход, который ведет к падению качества жизни.<br><br> Экономия не должна быть тотальной. Лучше подойти к решению проблемы с другой стороны и поискать дополнительные источники дохода, чтобы реализовать собственные желания. Главное замечать возможности, протекающие мимо. Тем самым, вы сможете понять, как повысить свой доход.",
  },
  {
    title: "Расширен список уполномоченных банков для открытия счета",
    src: "./images/1674259390_papik-pro-p-risunok-nalogi-50.png",
    span: "19 МАРТА 2023",
    article:
      " ООО «Банк Точка» стал десятым в списке уполномоченных банков, в которых <a href='https://ausn.nalog.gov.ru/'>плательщики автоУСН</a> могут открывать счета. Ранее к эксперименту присоединились АО КБ «Модульбанк», ПАО Сбербанк, Филиал Точка ПАО Банка «ФК Открытие», ПАО «Промсвязьбанк», АО «АЛЬФА-БАНК», АО «Тинькофф Банк», ПАО Банк ВТБ, ПАО АКБ «АК БАРС» и ООО «БЛАНК БАНК».<br><br> Открытие счета в уполномоченном банке, включенном в перечень ФНС России, является одним из условий применения нового<br><br><a href='https://www.nalog.gov.ru/rn77/taxation/taxes/autotax_system/'>специального налогового режима Автоматизированная упрощенная система налогообложения</a> (автоУСН).<br><br> Банки, участвующие в эксперименте:<br><br>- позволяют своим клиентам направлять уведомления о применении режима автоУСН;<br><br>- передают в налоговые органы данные операций по счетам налогоплательщиков, разметив их на относящиеся и не относящиеся к налоговой базе;<br><br>- направляют в налоговые органы корректировки клиентов-налогоплательщиков, связанные с переразметкой операций;<br><br>- исчисляют НДФЛ при получении от налоговых агентов (плательщиков автоУСН) сведений о выплате дохода своим сотрудникам, а также передают такие сведения в налоговые органы,<br><br>- перечисляют налоги при предоставлении налогоплательщиком права на получение реквизитов для формирования платежных документов и уплате налогов в бюджет.<br><br> Кредитные организации, желающие участвовать в эксперименте, могут подать заявку по форме, размещенной на промостранице об автоУСН.",
  },
  {
    title: "В каких случаях не допускается государственная регистрация",
    src: "./images/reg.png",
    span: "15 МАЯ 2023",
    article:
      " <b>Не допускается</b> внесение в Единый государственный реестр индивидуальных предпринимателей изменений, касающихся сведений об индивидуальном предпринимателе, связанных с <b>изменением кодов по Общероссийскому классификатору видов экономической деятельности*</b>, в случаях: — если индивидуальный предприниматель намерен осуществлять отдельные виды деятельности <b>в сфере образования, воспитания и развития несовершеннолетних** и при этом имеет или имел судимость,</b> подвергался уголовному преследованию (за исключением случаев, если уголовное преследование в отношении данного индивидуального предпринимателя прекращено по реабилитирующим основаниям) за совершение преступления против жизни и здоровья, свободы, чести и достоинства личности (за исключением незаконной госпитализации в медицинскую организацию, оказывающую психиатрическую помощь в стационарных условиях, и клеветы), половой неприкосновенности и половой свободы личности, против семьи и несовершеннолетних, здоровья населения и общественной нравственности, основ конституционного строя и безопасности государства, мира и безопасности человечества, общественной безопасности либо имеет неснятую или непогашенную судимость за иные умышленные тяжкие и особо тяжкие преступления;   — если индивидуальный предприниматель намерен осуществлять <b>вид предпринимательской деятельности в сфере перевозки пассажиров и багажа легковыми такси, автобусами, трамваями, троллейбусами и подвижным составом внеуличного транспорта*** и имеет неснятую или непогашенную судимость</b> за совершение преступлений, указанных в статье 328.1 Трудового кодекса Российской Федерации. <b>Источник:</b> *Пункт 5 статьи 22.2 Федерального закона от 08.08.2001 №129-ФЗ «О государственной регистрации юридических лиц и индивидуальных предпринимателей»;**Приложение к Постановлению Правительства РФ от 18 сентября 2018 г. №1103«О внесении изменений в перечень видов предпринимательской деятельности в сфере образования, воспитания, развития несовершеннолетних, организации их отдыха и оздоровления, медицинского обеспечения, социальной защиты и социального обслуживания, детско-юношеского спорта, культуры и искусства с участием несовершеннолетних, при осуществлении которых физическим лицом, регистрируемым в качестве индивидуального предпринимателя, представляется справка в регистрирующий орган о наличии (об отсутствии) судимости и (или) факта уголовного преследования либо прекращении уголовного преследования по реабилитирующим основаниям»;***Постановление Правительства РФ от 23.01.2023 г. №69 «Об утверждении перечня видов предпринимательской деятельности в сфере перевозки пассажиров и багажа легковыми такси, автобусами, трамваями, троллейбусами и подвижным составом внеуличного транспорта, при осуществлении которых физическим лицом, регистрируемым в качестве индивидуального предпринимателя, представляется справка в регистрирующий орган о наличии (отсутствии) судимости и (или) факта уголовного преследования либо о прекращении уголовного преследования по реабилитирующим основаниям»",
  },
  {
    title:
      "Российская экономика преодолела краткосрочный спад, заявили эксперты ЦБ",
    src: "./images/develope.png",
    span: "8 ДЕКАБРЯ 2023",
    article:
      "ЦБ: российская экономика преодолела краткосрочный спад из-за частичной мобилизации.<br><br> Российская экономика преодолела краткосрочный спад из-за частичной мобилизации и в целом в ноябре вернулась в фазу стабилизации, говорится в бюллетене департамента исследований и прогнозирования Банка России.<br><br> Действие дезинфляционного эффекта на потребительском рынке оказалось непродолжительным, указали аналитики.<br> Российская экономика в целом в ноябре вернулась в фазу стабилизации после кратковременной негативной реакции на шок в октябре. Частично это произошло из-за увеличения госзаказа», — указывается в материалах.<br><br> Выводы и рекомендации, содержащиеся в данных материалах, могут не совпадать с официальной позицией ЦБ.<br><br> Источник: https://ria.ru/20221207/ekonomika-1837056063.html",
  },
  {
    title: "Зачем стране бизнес, который надо поддерживать?",
    src: "./images/buisiness.png",
    span: "7 ДЕКАБРЯ 2023",
    article:
      "Алексей Тулупов, сооснователь «Росбилдинга» и владелец главного производителя хлеба в России, рассказал РБК о судьбе бывших заводов финской Fazer, как заработать на нарезном батоне и почему нынешнее время не похоже на 1990-е.<br><br> Алексей Тулупов стал одним из первых, кто купил активы уходящей из России иностранной компании: в апреле его холдинг «Коломенский» стал владельцем российского бизнеса финской компании Fazer.<br><br> Тулупов начал бизнес в 1990-х — вместе с Сергеем Гордеевым (сейчас — основной акционер группы ПИК) они создали компанию «Росбилдинг», которая специализировалась на слияниях и поглощениях. Фактически она скупала предприятия и перепродавала их. В 2007 году партнеры закрыли компанию и стали строить бизнес по отдельности. В конце того же года Тулупов основал компанию Sminex. В начале у нее была широкая специализация — она интересовалась инвестициями в девелопмент, ретейл, пищевую промышленность, нефть. В рознице, например, запустил и через несколько лет продал сеть «хобби-гипермаркетов» «Леонардо». Выкупил Тулупов и булочно-кондитерский комбинат «Коломенский»: предполагалось, что площадка будет разделена на производственный и девелоперский проекты, первый из которых компания продаст профильному инвестору. Но в итоге бизнесмен решил оставить весь бизнес и сделал «Коломенский» крупнейшим игроком хлебного рынка, а Sminex сосредоточилась на строительстве жилья высокого ценового сегмента в Москве.<br><br> Подробнее на РБК: <a href='https://www.rbc.ru/business/07/12/2022/637cbe339a79478463dcdab4'>https://www.rbc.ru/business/07/12/2022/637cbe339a79478463dcdab4</a>",
  },
];
let newsDiv = document.querySelector(".news-page");

document.querySelectorAll(".hidden-link").forEach((item, index) => {
  item.addEventListener("click", () => {
    let articleDiv = `<div class="news-page-inner">
    <div id="without" class="section-tilte">${news[index].title}</div>
    <div class="news-page-img">
        <img src=${news[index].src}>
    </div>
    <span>${news[index].span}</span>
    <div class="news-page-text">
        ${news[index].article}
    </div>
    <div class="share">
    <span>Поделиться: </span>
    <a href="">vkontakte</a>
    <a href="">telegram</a>
    <a href="">watsup</a>
    </div>
    <div class="news-page-to-articles">
    <a href="./index.html#blogs">Читать другие статьи >></a>
    </div>
</div>`;
    newsDiv.innerHTML = articleDiv;
  });
});

const text = [
  "Если Вы считаете, что компетентность стоит дорого, ",
  "то попробуйте некомпетентность — она обойдётся ",
  "Вам гораздо дороже.",
  "<br>",
  "<br>",
  "Йохан Стаель фон Хольстайн.",
];

let line = 0; //начальная линия текста
let count = 0; //счетчик позиции букв
let result = ""; //получаемый текст

function typeLine() {
  let interval = setTimeout(() => {
    result += text[line][count];
    document.querySelector(".typing").innerHTML = result + "|";
    count++;
    if (count >= text[line].length) {
      count = 0;
      line++;
      if (line == text.length) {
        clearTimeout(interval);
        document.querySelector(".typing").innerHTML = result;
        return true;
      }
    }
    typeLine();
  }, 50);
}
typeLine();

document.querySelector(".hamburger-menu").addEventListener("click", () => {
  document.querySelector(".container").classList.toggle("change");
});
Array.from(document.querySelectorAll(".menu-link")).forEach((item) => {
  item.onclick = () => {
    document.querySelector(".container").classList.remove("change");
  };
});

const activiti = function () {
  var galleryItems = document.querySelectorAll(".item");
  for (let i = 0; i < galleryItems.length; i++) {
    galleryItems[i].classList.toggle(
      "active",
      galleryItems[i].scrollTop > 0 || document.documentElement.scrollTop > 0
    );
  }
};

const moving = function () {
  var galleryItems = document.querySelectorAll(".cart");
  for (let i = 0; i < galleryItems.length; i++) {
    galleryItems[i].classList.toggle(
      "move",
      galleryItems[i].scrollTop > 0 || document.documentElement.scrollTop > 0
    );
  }
};
window.onscroll = function () {
  moving();
  activiti();
};
// Slider

let slider = tns({
  container: ".my-slider",
  slideBy: 1,
  speed: 600,
  autoplay: true,
  autoplayTimeout: 3000,
  autoplayButtonOutput: false,
  nav: false,
  controls: false,
  // controlsContainer: "#controls",
  // prevButton: ".previous",
  // nextButton: ".next",
  responsive: {
    1440: {
      items: 3,
      gutter: 20,
    },
    768: {
      items: 2,
      gutter: 20,
    },
    480: {
      items: 1,
    },
  },
});

// Slider End

let sliderTwo = tns({
  container: ".my-slider-2",
  slideBy: 1,
  speed: 600,
  autoplay: false,
  autoplayTimeout: 3000,
  autoplayButtonOutput: false,
  nav: false,
  controls: true,
  controlsContainer: "#controls",
  prevButton: ".previous",
  nextButton: ".next",
  touch: false,
  responsive: {
    1440: {
      items: 3,
      gutter: 20,
    },
    768: {
      items: 2,
      gutter: 20,
    },
    480: {
      items: 1,
    },
  },
});
